## Plan Result (prod_general - TerraformPlanApply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 5 to add, 3 to change, 4 to destroy.</code></pre>

* Create
  * azurerm_postgresql_server.atlassian-server
* Update
  * azurerm_application_gateway.ag
  * azurerm_key_vault.atlassian_kv
  * azurerm_postgresql_flexible_server.atlassian-flex-server
* Replace
  * azurerm_private_endpoint.postgres_private_endpoint
  * terraform_data.postgres[&#34;confluence&#34;]
  * terraform_data.postgres[&#34;crowd&#34;]
  * terraform_data.postgres[&#34;jira&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # data.azurerm_key_vault_secret.POSTGRES-FLEX-SERVER-PASS will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "POSTGRES-FLEX-SERVER-PASS" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-prod-kv"
      + name                    = "prod-POSTGRES-FLEX-SERVER-PASS"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.POSTGRES-FLEX-SERVER-USER will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "POSTGRES-FLEX-SERVER-USER" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-prod-kv"
      + name                    = "prod-POSTGRES-FLEX-SERVER-USER"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.POSTGRES-SINGLE-SERVER-PASS will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "POSTGRES-SINGLE-SERVER-PASS" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-prod-kv"
      + name                    = "prod-POSTGRES-SINGLE-SERVER-PASS"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.POSTGRES-SINGLE-SERVER-USER will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "POSTGRES-SINGLE-SERVER-USER" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-prod-kv"
      + name                    = "prod-POSTGRES-SINGLE-SERVER-USER"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.admin_private_key will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "admin_private_key" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-prod-kv"
      + name                    = "test-private-key"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.admin_username will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "admin_username" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-prod-kv"
      + name                    = "vm-admin-username"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # azurerm_application_gateway.ag will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                                = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Network/applicationGateways/atlassian-prod-app-gateway"
        name                              = "atlassian-prod-app-gateway"
        tags                              = {
            "application"  = "atlassian"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
            "startupMode"  = "always"
        }
        # (8 unchanged attributes hidden)

      - probe {
          - id                                        = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Network/applicationGateways/atlassian-prod-app-gateway/probes/appgw-probe-cnf" -> null
          - interval                                  = 30 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "appgw-probe-cnf" -> null
          - path                                      = "/confluence" -> null
          - pick_host_name_from_backend_http_settings = true -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 30 -> null
          - unhealthy_threshold                       = 3 -> null
            # (1 unchanged attribute hidden)

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      - probe {
          - id                                        = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Network/applicationGateways/atlassian-prod-app-gateway/probes/appgw-probe-crd" -> null
          - interval                                  = 30 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "appgw-probe-crd" -> null
          - path                                      = "/crowd" -> null
          - pick_host_name_from_backend_http_settings = true -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 30 -> null
          - unhealthy_threshold                       = 3 -> null
            # (1 unchanged attribute hidden)

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      - probe {
          - id                                        = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Network/applicationGateways/atlassian-prod-app-gateway/probes/appgw-probe-jira" -> null
          - interval                                  = 30 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "appgw-probe-jira" -> null
          - path                                      = "/jira/status" -> null
          - pick_host_name_from_backend_http_settings = true -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 30 -> null
          - unhealthy_threshold                       = 3 -> null
            # (1 unchanged attribute hidden)

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "appgw-probe-cnf"
          + path                                      = "/confluence"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Http"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
            # (1 unchanged attribute hidden)
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "appgw-probe-crd"
          + path                                      = "/crowd"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Http"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
            # (1 unchanged attribute hidden)
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "appgw-probe-jira"
          + path                                      = "/jira/status"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Http"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
            # (1 unchanged attribute hidden)
        }

      - request_routing_rule {
          - http_listener_id            = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Network/applicationGateways/atlassian-prod-app-gateway/httpListeners/appgw-http-listener" -> null
          - http_listener_name          = "appgw-http-listener" -> null
          - id                          = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Network/applicationGateways/atlassian-prod-app-gateway/requestRoutingRules/appgw-routing-rule" -> null
          - name                        = "appgw-routing-rule" -> null
          - priority                    = 1 -> null
          - rule_type                   = "PathBasedRouting" -> null
          - url_path_map_id             = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Network/applicationGateways/atlassian-prod-app-gateway/urlPathMaps/appgw-url-map-path" -> null
          - url_path_map_name           = "appgw-url-map-path" -> null
            # (8 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "appgw-backend-pool-cnf"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "appgw-backend-settings-cnf"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "appgw-http-listener"
          + id                          = (known after apply)
          + name                        = "appgw-routing-rule"
          + priority                    = 1
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rule_type                   = "PathBasedRouting"
          + url_path_map_id             = (known after apply)
          + url_path_map_name           = "appgw-url-map-path"
            # (2 unchanged attributes hidden)
        }

        # (18 unchanged blocks hidden)
    }

  # azurerm_key_vault.atlassian_kv will be updated in-place
  ~ resource "azurerm_key_vault" "atlassian_kv" {
      ~ access_policy                   = [
            {
                application_id          = null
                certificate_permissions = []
                key_permissions         = []
                object_id               = "d309fbf5-9c92-470f-a11a-f307cf73fd00"
                secret_permissions      = [
                    "Get",
                    "List",
                    "Set",
                    "Delete",
                    "Purge",
                ]
                storage_permissions     = []
                tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
          + {
              + certificate_permissions = []
              + key_permissions         = []
              + object_id               = "d309fbf5-9c92-470f-a11a-f307cf73fd00"
              + secret_permissions      = [
                  + "Get",
                  + "List",
                  + "Set",
                  + "Delete",
                  + "Purge",
                ]
              + storage_permissions     = []
              + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
                # (1 unchanged attribute hidden)
            },
            {
                application_id          = null
                certificate_permissions = [
                    "Get",
                    "List",
                    "Update",
                    "Create",
                    "Import",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                    "ManageContacts",
                    "ManageIssuers",
                    "GetIssuers",
                    "ListIssuers",
                    "SetIssuers",
                    "DeleteIssuers",
                ]
                key_permissions         = [
                    "Get",
                    "List",
                    "Update",
                    "Create",
                    "Import",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                    "GetRotationPolicy",
                    "SetRotationPolicy",
                    "Rotate",
                ]
                object_id               = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
                secret_permissions      = [
                    "Get",
                    "List",
                    "Set",
                    "Delete",
                    "Purge",
                ]
                storage_permissions     = []
                tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
            # (2 unchanged elements hidden)
        ]
        id                              = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-prod-kv"
        name                            = "atlasssian-prod-kv"
        tags                            = {
            "application"  = "atlassian"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
            "startupMode"  = "always"
        }
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_postgresql_flexible_server.atlassian-flex-server will be updated in-place
  ~ resource "azurerm_postgresql_flexible_server" "atlassian-flex-server" {
      ~ administrator_password            = (sensitive value)
        id                                = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/atlassian-prod-flex-server"
        name                              = "atlassian-prod-flex-server"
        tags                              = {
            "application"  = "atlassian"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
            "startupMode"  = "always"
        }
        # (18 unchanged attributes hidden)

      ~ authentication {
          + tenant_id                     = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_postgresql_server.atlassian-server will be created
  + resource "azurerm_postgresql_server" "atlassian-server" {
      + administrator_login              = (sensitive value)
      + administrator_login_password     = (sensitive value)
      + administrator_login_password_wo  = (write-only attribute)
      + auto_grow_enabled                = true
      + backup_retention_days            = (known after apply)
      + create_mode                      = "Default"
      + fqdn                             = (known after apply)
      + geo_redundant_backup_enabled     = false
      + id                               = (known after apply)
      + location                         = "uksouth"
      + name                             = "atlassian-prod-server"
      + public_network_access_enabled    = false
      + resource_group_name              = "atlassian-prod-rg"
      + sku_name                         = "MO_Gen5_8"
      + ssl_enforcement_enabled          = true
      + ssl_minimal_tls_version_enforced = "TLS1_2"
      + storage_mb                       = 204800
      + tags                             = {
          + "application"  = "atlassian"
          + "builtFrom"    = "hmcts/atlassian-infrastructure"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
          + "startupMode"  = "always"
        }
      + version                          = "11"
    }

  # azurerm_private_endpoint.postgres_private_endpoint must be replaced
-/+ resource "azurerm_private_endpoint" "postgres_private_endpoint" {
      ~ custom_dns_configs            = [] -> (known after apply)
      ~ id                            = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Network/privateEndpoints/atlassian-prod-postgres-pe" -> (known after apply)
        name                          = "atlassian-prod-postgres-pe"
      ~ network_interface             = [
          - {
              - id   = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Network/networkInterfaces/atlassian-prod-postgres-pe.nic.b5279785-e013-470b-beac-e3239bf47e42"
              - name = "atlassian-prod-postgres-pe.nic.b5279785-e013-470b-beac-e3239bf47e42"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs      = [
          - {
              - id                  = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Network/privateEndpoints/atlassian-prod-postgres-pe/privateDnsZoneGroups/privatelink.postgres.database.azure.com/privateDnsZoneConfigs/privatelink.postgres.database.azure.com"
              - name                = "privatelink.postgres.database.azure.com"
              - private_dns_zone_id = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.postgres.database.azure.com"
              - record_sets         = []
            },
        ] -> (known after apply)
        tags                          = {
            "application"  = "atlassian"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
            "startupMode"  = "always"
        }
        # (4 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.Network/privateEndpoints/atlassian-prod-postgres-pe/privateDnsZoneGroups/privatelink.postgres.database.azure.com" -> (known after apply)
            name                 = "privatelink.postgres.database.azure.com"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
            name                              = "postgres-psc"
          ~ private_connection_resource_id    = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.DBforPostgreSQL/servers/atlassian-prod-server" -> (known after apply) # forces replacement
          ~ private_ip_address                = "10.1.4.4" -> (known after apply)
            # (4 unchanged attributes hidden)
        }
    }

  # terraform_data.postgres["confluence"] must be replaced
-/+ resource "terraform_data" "postgres" {
      ~ id               = "d292764b-e859-e46f-a7b3-c66b9830bfdf" -> (known after apply)
      ~ triggers_replace = [
          ~ "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.DBforPostgreSQL/servers/atlassian-prod-server" -> (known after apply),
            "https://atlasssian-prod-kv.vault.azure.net/secrets/confluence-db-prod-postgres-password/bc1071d94f714b319bb013810f74e87b",
            # (1 unchanged element hidden)
        ]
    }

  # terraform_data.postgres["crowd"] must be replaced
-/+ resource "terraform_data" "postgres" {
      ~ id               = "0cb2c3ea-15b1-8f8b-17a6-b89247fd94db" -> (known after apply)
      ~ triggers_replace = [
          ~ "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.DBforPostgreSQL/servers/atlassian-prod-server" -> (known after apply),
            "https://atlasssian-prod-kv.vault.azure.net/secrets/crowd-db-prod-postgres-password/9d8314c0438145ac93543a8f054a0008",
            # (1 unchanged element hidden)
        ]
    }

  # terraform_data.postgres["jira"] must be replaced
-/+ resource "terraform_data" "postgres" {
      ~ id               = "72dd2cfe-979f-9b5c-82fa-2d94b257c950" -> (known after apply)
      ~ triggers_replace = [
          ~ "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.DBforPostgreSQL/servers/atlassian-prod-server" -> (known after apply),
            "https://atlasssian-prod-kv.vault.azure.net/secrets/jira-db-prod-postgres-password/7fcf5711a57e4528b930c2c46625686b",
            # (1 unchanged element hidden)
        ]
    }

Plan: 5 to add, 3 to change, 4 to destroy.
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # azurerm_postgresql_server.atlassian-server has been deleted
  - resource "azurerm_postgresql_server" "atlassian-server" {
      - administrator_login_password_wo         = (write-only attribute) -> null
      - id                                      = "/subscriptions/79898897-729c-41a0-a5ca-53c764839d95/resourceGroups/atlassian-prod-rg/providers/Microsoft.DBforPostgreSQL/servers/atlassian-prod-server" -> null
        name                                    = "atlassian-prod-server"
        tags                                    = {
            "application"  = "atlassian"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
            "startupMode"  = "always"
        }
        # (17 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":77,"Program":"tfcmt","SHA1":"","Target":"prod_general - TerraformPlanApply","Vars":{}} -->